levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_tmra.h
/**
 * @defgroup TIMERA_Hardware_Count_Down_Condition TimerA Hardware Count Down Condition
 * @note TIMA_<t>_TRIG t is unit number,value is 1 to 4. 
 * @note TIMA_<t>_CLKA or TIMA_<t>_CLKB t is unit number,value is 3 to 4.
 * @note n is 2 or 4 when m is 1 or 3, n is 1 or 3 when m is 2 or 4.
 * @{
 */
#define TIMERA_HWDOWN_INVALID                   ((uint16_t)0x0000U)     /*!< Hardware count down is invalid */
#define TIMERA_HWDOWN_CLKA_LOW_CLKB_RISING      (TMRA_HCDOR_HCDO0)      /*!< Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level   */
#define TIMERA_HWDOWN_CLKA_LOW_CLKB_FALLING     (TMRA_HCDOR_HCDO1)      /*!< Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level  */
#define TIMERA_HWDOWN_CLKA_HIGH_CLKB_RISING     (TMRA_HCDOR_HCDO2)      /*!< Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level  */
#define TIMERA_HWDOWN_CLKA_HIGH_CLKB_FALLING    (TMRA_HCDOR_HCDO3)      /*!< Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level */
#define TIMERA_HWDOWN_CLKB_LOW_CLKA_RISING      (TMRA_HCDOR_HCDO4)      /*!< Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level   */
#define TIMERA_HWDOWN_CLKB_LOW_CLKA_FALLING     (TMRA_HCDOR_HCDO5)      /*!< Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level  */
#define TIMERA_HWDOWN_CLKB_HIGH_CLKA_RISING     (TMRA_HCDOR_HCDO6)      /*!< Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level  */
#define TIMERA_HWDOWN_CLKB_HIGH_CLKA_FALLING    (TMRA_HCDOR_HCDO7)      /*!< Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level */
#define TIMERA_HWDOWN_TRIG_RISING               (TMRA_HCDOR_HCDO8)      /*!< Hardware count down by rising edge on timer input TIMA_<t>_TRIG */
#define TIMERA_HWDOWN_TRIG_FALLING              (TMRA_HCDOR_HCDO9)      /*!< Hardware count down by falling edge on timer input TIMA_<t>_TRIG */
#define TIMERA_HWDOWN_SPECIFY_EVT               (TMRA_HCDOR_HCDO10)     /*!< Hardware count down by the timer TMRA0_HTSSR specified event */
#define TIMERA_HWDOWN_UNIT_N_COUNT_OVERFLOW     (TMRA_HCDOR_HCDO11)     /*!< When this unit is m, unit n generates a count overflow to trigger hardware count down */
#define TIMERA_HWDOWN_UNIT_N_COUNT_UNDERFLOW    (TMRA_HCDOR_HCDO12)     /*!< When this unit is m, unit n generates a count underflow to trigger the hardware count down */
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TIMERA_Global_Functions
 * @{
 */

/**
 * @brief  Set counter trigger event source.
 * @param  [in] enEvtSrc                Trigger event source @ref en_event_src_t
 * @retval None
 */
__STATIC_INLINE void TIMERA_SetCounterTriggerSrc(en_event_src_t enEvtSrc)
{
    WRITE_REG32(M4_AOS->TMRA0_HTSSR, enEvtSrc);
}

/**
 * @brief  Set capture trigger event source.
 * @param  [in] enEvtSrc                Trigger event source @ref en_event_src_t
 * @retval None
 */
__STATIC_INLINE void TIMERA_SetCaptureTriggerSrc(en_event_src_t enEvtSrc)
{
    WRITE_REG32(M4_AOS->TMRA1_HTSSR, enEvtSrc);
}

/* Initialization and configuration TimerA base functions */
en_result_t TIMERA_DeInit(M4_TMRA_TypeDef *TMRAx);
en_result_t TIMERA_Init(M4_TMRA_TypeDef *TMRAx,
                        stc_timera_init_t *pstcInit);
en_result_t TIMERA_StructInit(stc_timera_init_t *pstcInit);
void TIMERA_SetCounter(M4_TMRA_TypeDef *TMRAx, uint16_t u16Value);
uint16_t TIMERA_GetCounter(M4_TMRA_TypeDef *TMRAx);
void TIMERA_SetPeriod(M4_TMRA_TypeDef *TMRAx, uint16_t u16Value);
uint16_t TIMERA_GetPeriod(M4_TMRA_TypeDef *TMRAx);
void TIMERA_SetClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_SyncStartCmd(M4_TMRA_TypeDef *TMRAx,
                         en_functional_state_t enNewSta);
void TIMERA_EventCmd(M4_TMRA_TypeDef *TMRAx, uint16_t u16EvtSource,
                     en_functional_state_t enNewSta);
void TIMERA_Cmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetTrigFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_TrigFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetClkAFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_ClkAFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetClkBFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_ClkBFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);

/* Configuration TimerA Hardware trigger functions */
void TIMERA_SetHwTriggerCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwTriggerCondition(M4_TMRA_TypeDef *TMRAx);
void TIMERA_SetHwStartCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwStopCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwClearCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwUpCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwUpCondition(M4_TMRA_TypeDef *TMRAx);
void TIMERA_SetHwDownCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwDownCondition(M4_TMRA_TypeDef *TMRAx);

/* Initialization and configuration TimerA input capture functions */
en_result_t TIMERA_IC_DeInit(M4_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel);
en_result_t TIMERA_IC_Init(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_ic_init_t *pstcIcInit);
en_result_t TIMERA_IC_StructInit(stc_timera_ic_init_t *pstcIcInit);
uint16_t TIMERA_IC_GetCapture(M4_TMRA_TypeDef *TMRAx,
                              uint8_t u8Channel);
void TIMERA_IC_SetCaptureCondition(M4_TMRA_TypeDef *TMRAx,
                                   uint8_t u8Channel,
                                   uint16_t u16Condition);
void TIMERA_IC_FilterCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                         en_functional_state_t enNewSta);
void TIMERA_IC_SetFilterClkDiv(M4_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel, uint16_t u16Div);

